In [20]:
import os
#os.chdir("C:\\Users\\Poori\\Desktop\\Udemy\\A-Z Machine learning Kaggle\\Github\\DataSet")
os.chdir("C:\\Users\\Poori\\Desktop\\Udemy\\A-Z Machine learning Kaggle\\Github\\Python Basics\\Course Files\\datacode")

In [61]:
import pandas as pd
coffee=pd.read_csv("coffee_info.csv")
coffee.head()

,Person_ID,Cups_Per_Week,Age,Gender,Employment,Education,Income,Married,Own_Home,Smoker,Favourite_NonAlc_Drink,Veg,cup_tea,spend_food
0,5,1,60.0,F,fulltime,high school,45000.0,married,no,yes,tea,nonveg,0,11787
1,6,1,40.0,F,fulltime,high school,46000.0,married,no,no,other,veg,6,18674
2,9,3,NaN,F,fulltime,high school,47000.0,married,no,no,coffee,veg,1,14814
3,14,5,20.0,F,fulltime,gradschool,65000.0,single,no,yes,softdrink,nonveg,0,22997
4,15,0,50.0,F,fulltime,high school,46000.0,married,yes,no,coffee,nonveg,5,14606

In [24]:
data=coffee[coffee['Education']=='high school']

In [25]:
data

,Person_ID,Cups_Per_Week,Age,Gender,Employment,Education,Income,Married,Own_Home,Smoker,Favourite_NonAlc_Drink,Veg,cup_tea,spend_food
0,5,1,60.0,F,fulltime,high school,45000.0,married,no,yes,tea,nonveg,0,11787
1,6,1,40.0,F,fulltime,high school,46000.0,married,no,no,other,veg,6,18674
2,9,3,NaN,F,fulltime,high school,47000.0,married,no,no,coffee,veg,1,14814
4,15,0,50.0,F,fulltime,high school,46000.0,married,yes,no,coffee,nonveg,5,14606
5,18,0,60.0,F,fulltime,high school,46000.0,single,yes,no,coffee,nonveg,6,14699
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
244,181,0,20.0,M,unempl,high school,8000.0,single,no,no,coffee,nonveg,0,1669
245,183,1,40.0,M,unempl,high school,11000.0,married,yes,yes,tea,nonveg,0,2246
246,193,0,30.0,M,unempl,high school,9000.0,single,yes,no,coffee,nonveg,3,4595
247,226,0,40.0,M,unempl,high school,11000.0,single,no,no,softdrink,veg,1,2102
249,242,0,20.0,M,unempl,high school,7000.0,married,no,yes,coffee,veg,1,2857

In [26]:
data['Age'].mean()

40.41095890410959

In [30]:
data['Age'].sum()

5900.0

In [28]:
data['Age'].max()

60.0

In [17]:
data['Age'].min()

0

In [31]:
coffee.columns

Index(['Person_ID', 'Cups_Per_Week', 'Age', 'Gender', 'Employment',
       'Education', 'Income', 'Married', 'Own_Home', 'Smoker',
       'Favourite_NonAlc_Drink', 'Veg', 'cup_tea', 'spend_food'],
      dtype='object')

In [32]:
data['Age'].std()

13.840306570691027

In [35]:
data=coffee[(coffee['Education']=='high school') & (coffee['Employment']=='fulltime')]

In [36]:
data['Employment'].count()

83

In [46]:
data.count()

Person_ID                 83
Cups_Per_Week             83
Age                       82
Gender                    83
Employment                83
Education                 83
Income                    82
Married                   83
Own_Home                  83
Smoker                    83
Favourite_NonAlc_Drink    83
Veg                       83
cup_tea                   83
spend_food                83
dtype: int64

In [63]:
#coffee['Smoker']=coffee['Smoker'].map( {'yes':1, 'no':0})
#coffee.head()
coffee['Own_Home']=coffee['Own_Home'].map( {'yes':1, 'no':0})
coffee.head()

,Person_ID,Cups_Per_Week,Age,Gender,Employment,Education,Income,Married,Own_Home,Smoker,Favourite_NonAlc_Drink,Veg,cup_tea,spend_food
0,5,1,60.0,F,fulltime,high school,45000.0,married,0,1,tea,nonveg,0,11787
1,6,1,40.0,F,fulltime,high school,46000.0,married,0,0,other,veg,6,18674
2,9,3,NaN,F,fulltime,high school,47000.0,married,0,0,coffee,veg,1,14814
3,14,5,20.0,F,fulltime,gradschool,65000.0,single,0,1,softdrink,nonveg,0,22997
4,15,0,50.0,F,fulltime,high school,46000.0,married,1,0,coffee,nonveg,5,14606

In [65]:
coffee['Own_Home'].mean()
coffee['Own_Home'].unique()

array([0, 1], dtype=int64)

In [66]:
coffee['Smoker'].groupby(coffee['Education']).sum()

Education
bachelors      14
gradschool     15
high school    53
Name: Smoker, dtype: int64

In [68]:
coffee['Own_Home'].groupby(coffee['Education']).sum()

Education
bachelors      19
gradschool     13
high school    36
Name: Own_Home, dtype: int64

In [69]:
coffee['Own_Home'].groupby(coffee['Education']).aggregate(sum)

Education
bachelors      19
gradschool     13
high school    36
Name: Own_Home, dtype: int64

In [73]:
coffee['Own_Home'].groupby(coffee['Education']).aggregate([sum, np.mean, np.std, np.median])

             sum      mean       std  median
Education
bachelors     19  0.287879  0.456244       0
gradschool    13  0.371429  0.490241       0
high school   36  0.241611  0.429503       0

In [ ]:
#Types of Joins usign python

In [41]:
import pandas as pd
import numpy as np
d1 = {'Customer_id':pd.Series([1,2,3,4,5,6]),
  'Product':pd.Series(['Oven','Oven','Oven','Television','Television','Television'])}
df1 = pd.DataFrame(d1)

d2 = {'Customer_id':pd.Series([2,4,6]),
    'State':pd.Series(['California','California','Texas'])}
df2 = pd.DataFrame(d2)

In [42]:
pd.merge(df1, df2, on='Customer_id', how='inner')

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

In [43]:
pd.merge(df1, df2, on='Customer_id', how='outer')

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

In [44]:
pd.merge(df1, df2, on='Customer_id', how='left')

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

In [45]:
pd.merge(df1, df2, on='Customer_id', how='right')

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas